notes/nov6/nov6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-13 Mon 01:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Monads</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Monads</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc758c1">1. What is a monad?</a>
<ul>
<li><a href="#org50d701f">1.1. Definition and examples</a></li>
<li><a href="#org87cebd1">1.2. <code>do</code> notation and examples</a></li>
<li><a href="#org483fc3b">1.3. The laws using <code>do</code> notation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This short set of notes will be all about monads (woohoo!)?
</p>

<div id="outline-container-orgcc758c1" class="outline-2">
<h2 id="orgcc758c1"><span class="section-number-2">1.</span> What is a monad?</h2>
<div class="outline-text-2" id="text-1">
<p>
A monad is a kind of structure which is commonly employed in functional
programming, in order to design programs with clearly understood meanings.
More concretely, a lot of the time, functional programmers want to write
programs that have some kind of <i>effect</i> associated with them&#x2014;this might be
gathering things up into a list, returning a value randomly (given some
probability distribution), printing something to standard output, keeping
track of a global state, reading information in from an environment, or any
number of other things that programmers like to write programs that do. Monads
allow one to write functional programs that do those sorts of things in highly
structured ways, i.e., by (a) providing tight control over where exactly in a
program an effect <i>happens</i>, and (b) cleanly separating operations that target
ordinary <i>values</i> from operations that target the effects which with which such
values might be associated.
</p>
</div>

<div id="outline-container-org50d701f" class="outline-3">
<h3 id="org50d701f"><span class="section-number-3">1.1.</span> Definition and examples</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In Haskell, there <code>Monad</code> provides a class.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Monad</span> f <span style="color: #fb4933;">where</span>
  return <span style="color: #83a598;">::</span> a <span style="color: #83a598;">-&gt;</span> f a
  (<span style="color: #83a598;">&gt;&gt;=</span>) <span style="color: #83a598;">::</span> f a <span style="color: #83a598;">-&gt;</span> (a <span style="color: #83a598;">-&gt;</span> f b) <span style="color: #83a598;">-&gt;</span> f b <span style="color: #928374;">-- </span><span style="color: #928374;">'bind'</span>
</pre>
</div>
<p>
Technically, a monad is a <i>functor</i>&#x2014;that is, a map from types to
types&#x2014;associated with two operations, <code>return</code> and <code>(&gt;&gt;=)</code>. The role of <code>return</code>
is to bring an ordinary value of type <code>a</code> into the monad, by turning it into a
new thing of type <code>f a</code>. The role of <code>(&gt;&gt;=)</code> is to sequence programs that have
monadic effects. <code>(&gt;&gt;=)</code> takes a program of type <code>f a</code>, along with a program of
type <code>f b</code>, but <i>indexed</i> by a value of type <code>a</code> (i.e., a function of type <code>a -&gt; f
   b</code>), and gives back a program of type <code>f b</code>. Essentially, in <code>m &gt;&gt;= k</code>, <code>m</code> is
providing some value of type <code>a</code>, which is allowed to somehow fill in <code>k</code>'s
missing <code>a</code>-shaped piece, giving back a result of type <code>f b</code>.
</p>

<p>
Monads must satisfy certain laws; in particular the following:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">return</span> a <span style="color: #83a598;">&gt;&gt;=</span> k   <span style="color: #83a598;">=</span>  k a                     <span style="color: #928374;">-- </span><span style="color: #928374;">Left identity</span>
m <span style="color: #fabd2f;">&gt;&gt;=</span> return     <span style="color: #83a598;">=</span>  m                       <span style="color: #928374;">-- </span><span style="color: #928374;">Right identity</span>
(m <span style="color: #83a598;">&gt;&gt;=</span> n) <span style="color: #83a598;">&gt;&gt;=</span> o  <span style="color: #83a598;">=</span>  m <span style="color: #83a598;">&gt;&gt;=</span> (<span style="color: #83a598;">\</span>x <span style="color: #83a598;">-&gt;</span> n x <span style="color: #83a598;">&gt;&gt;=</span> o) <span style="color: #928374;">-- </span><span style="color: #928374;">Associativity</span>
</pre>
</div>

<p>
One particular monad is the <code>Maybe</code> monad. Thus <code>Maybe</code> has the following monadic
instance:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Monad</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #fb4933;">where</span>
  return        <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Just</span>
  <span style="color: #d3869b;">Nothing</span> <span style="color: #83a598;">&gt;&gt;=</span> <span style="color: #fb4933;">_</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Nothing</span>
  <span style="color: #d3869b;">Just</span> a <span style="color: #83a598;">&gt;&gt;=</span> k  <span style="color: #83a598;">=</span> k a
</pre>
</div>
<p>
Another example is the list monad:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Monad</span> <span style="color: #d3869b;">[]</span> <span style="color: #fb4933;">where</span>
  return a     <span style="color: #83a598;">=</span> [a]
  <span style="color: #d3869b;">[]</span> <span style="color: #83a598;">&gt;&gt;=</span> <span style="color: #fb4933;">_</span>     <span style="color: #83a598;">=</span> <span style="color: #d3869b;">[]</span>
  (a<span style="color: #d3869b;">:</span>as) <span style="color: #83a598;">&gt;&gt;=</span> k <span style="color: #83a598;">=</span> k a <span style="color: #83a598;">++</span> as <span style="color: #83a598;">&gt;&gt;=</span> k
</pre>
</div>
</div>
</div>

<div id="outline-container-org87cebd1" class="outline-3">
<h3 id="org87cebd1"><span class="section-number-3">1.2.</span> <code>do</code> notation and examples</h3>
<div class="outline-text-3" id="text-1-2">
<p>
One great thing about using monads in Haskell is the availability of <code>do</code>
notation. In particular, rather than writing a monadic program in the form
</p>
<div class="org-src-container">
<pre class="src src-haskell">m <span style="color: #fabd2f;">&gt;&gt;=</span> <span style="color: #83a598;">\</span>x <span style="color: #83a598;">-&gt;</span> k x
</pre>
</div>
<p>
one can write it using <code>do</code> notation as
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">do</span> x <span style="color: #83a598;">&lt;-</span> m
   k x
</pre>
</div>

<p>
For example, if one wanted to have a program that adds two numbers inside the
<code>Maybe</code> monad, one could do the following:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">addTwoNumbers</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #d3869b;">Integer</span>
<span style="color: #fabd2f;">addTwoNumbers</span> <span style="color: #83a598;">=</span> <span style="color: #fb4933;">do</span> m <span style="color: #83a598;">&lt;-</span> <span style="color: #d3869b;">Just</span> 3
                   n <span style="color: #83a598;">&lt;-</span> <span style="color: #d3869b;">Just</span> 2
                   return (m <span style="color: #83a598;">+</span> n)
</pre>
</div>
<p>
By unpacking the <code>do</code> notation, it's possible to rewrite this program as
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #d3869b;">Just</span> 3 <span style="color: #83a598;">&gt;&gt;=</span> <span style="color: #83a598;">\</span>m <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Just</span> 2 <span style="color: #83a598;">&gt;&gt;=</span> <span style="color: #83a598;">\</span>n <span style="color: #83a598;">-&gt;</span> return (m <span style="color: #83a598;">+</span> n)
</pre>
</div>
<p>
which computes to <code>Just 5</code>. If we wanted to have a program that fails, we could
write the following instead:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">addTwoNumbers</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #d3869b;">Integer</span>
<span style="color: #fabd2f;">addTwoNumbers</span> <span style="color: #83a598;">=</span> <span style="color: #fb4933;">do</span> m <span style="color: #83a598;">&lt;-</span> <span style="color: #d3869b;">Just</span> 3
                   n <span style="color: #83a598;">&lt;-</span> <span style="color: #d3869b;">Just</span> 2
                   i <span style="color: #83a598;">&lt;-</span> <span style="color: #d3869b;">Nothing</span> 
                   return (m <span style="color: #83a598;">+</span> n)
</pre>
</div>
<p>
This program fails because it attempts to pull an integer <code>i</code> out of a <code>Nothing</code>,
i.e., a failed computation. Indeed, such failure results regardless of
whether or not the hypothetical value <code>i</code> is actually used.
</p>

<p>
To take another example, imagine we want to do an operation on two  numbers,
but which, this time, are extracted from <i>lists</i> of integers. Then we could do,
e.g.,
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">combineTwoNumbersFromLists</span> <span style="color: #83a598;">::</span> [<span style="color: #d3869b;">Integer</span>]
<span style="color: #fabd2f;">combineTwoNumbersFromLists</span> <span style="color: #83a598;">=</span> <span style="color: #fb4933;">do</span> m <span style="color: #83a598;">&lt;-</span> [1, 2]
                                n <span style="color: #83a598;">&lt;-</span> [3, 4]
                                op <span style="color: #83a598;">&lt;-</span> [(<span style="color: #83a598;">+</span>), (<span style="color: #83a598;">*</span>)]
                                return (m <span style="color: #83a598;">`op`</span> n)
</pre>
</div>
<p>
This program should compute to
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span> combineTwoNumbersFromLists
[4,3,5,4,5,6,6,8]
</pre>
</div>
<p>
Note that the order of the <code>do</code> statements affects the order of the integers as
they occur in the computed result, although the identity and number of these
integers won't vary. In particular, first <code>1</code> is added to <code>3</code>, then <code>1</code> is
multiplied by <code>3</code>, then <code>1</code> is added to <code>4</code>, then multiplied by <code>4</code>, and then we do
the same thing with <code>2</code>.
</p>
</div>
</div>

<div id="outline-container-org483fc3b" class="outline-3">
<h3 id="org483fc3b"><span class="section-number-3">1.3.</span> The laws using <code>do</code> notation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In my opinion, the monad laws look a bit nice when presented using <code>do</code>
notation.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">do</span> x <span style="color: #83a598;">&lt;-</span> return a   <span style="color: #83a598;">=</span>  k a           <span style="color: #928374;">-- </span><span style="color: #928374;">Left identity</span>
   k x
<span style="color: #fb4933;">do</span> x <span style="color: #83a598;">&lt;-</span> m          <span style="color: #83a598;">=</span>  m             <span style="color: #928374;">-- </span><span style="color: #928374;">Right Identity</span>
   return x
<span style="color: #fb4933;">do</span> y <span style="color: #83a598;">&lt;-</span> <span style="color: #fb4933;">do</span> x <span style="color: #83a598;">&lt;-</span> m  <span style="color: #83a598;">=</span>  <span style="color: #fb4933;">do</span> x <span style="color: #83a598;">&lt;-</span> m     <span style="color: #928374;">-- </span><span style="color: #928374;">Associativity</span>
           n x           y <span style="color: #83a598;">&lt;-</span> n x
   o y                   o y
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-11-13 Mon 01:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
